Workspace/OpenFOAM-v1812-AD/tutorials/multiphase/interFoam/LES/nozzleFlow2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh

for i in 1 2
do
    runApplication -s $i \
        topoSet -dict system/topoSetDict.${i}

    runApplication -s $i \
        refineMesh -dict system/refineMeshDict -overwrite
done

runApplication $(getApplication)

#------------------------------------------------------------------------------
